Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/svd/PIC32CM5164LS00048.svd
            <register>
               <name>WAVE</name>
               <description>Waveform Control</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WAVEGEN</name>
                     <description>Waveform Generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>WAVEGENSelect</name>
                        <enumeratedValue>
                           <name>NFRQ</name>
                           <description>Normal frequency</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MFRQ</name>
                           <description>Match frequency</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NPWM</name>
                           <description>Normal PWM</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DPWM</name>
                           <description>Dual compare PWM</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSCRITICAL</name>
                           <description>Dual-slope critical</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSBOTTOM</name>
                           <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSBOTH</name>
                           <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSTOP</name>
                           <description>Dual-slope with interrupt/event condition when COUNT reaches TOP</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RAMP</name>
                     <description>Ramp Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RAMPSelect</name>
                        <enumeratedValue>
                           <name>RAMP1</name>
                           <description>RAMP1 operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2A</name>
                           <description>Alternative RAMP2 operation</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2</name>
                           <description>RAMP2 operation</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2C</name>
                           <description>Critical RAMP2 operation</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2CS</name>
                           <description>Critical Swapped RAMP2 operation</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CIPEREN</name>
                     <description>Circular period Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCEN0</name>
                     <description>Circular Channel 0 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCEN1</name>
                     <description>Circular Channel 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCEN2</name>
                     <description>Circular Channel 2 Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCEN3</name>
                     <description>Circular Channel 3 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL0</name>
                     <description>Channel 0 Polarity</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>POL0Select</name>
                        <enumeratedValue>
                           <name>SINGLESLOPEPOL0</name>
                           <description>Single-slope PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLESLOPEPOL1</name>
                           <description>Single-slope PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALSLOPEPOL0</name>
                           <description>Dual-slope PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALSLOPEPOL1</name>
                           <description>Dual-slope PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALCOMPAREPOL0</name>
                           <description>Dual Compare PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALCOMPAREPOL1</name>
                           <description>Dual Compare PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL1</name>
                     <description>Channel 1 Polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>POL1Select</name>
                        <enumeratedValue>
                           <name>SINGLESLOPEPOL0</name>
                           <description>Single-slope PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLESLOPEPOL1</name>
                           <description>Single-slope PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALSLOPEPOL0</name>
                           <description>Dual-slope PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALSLOPEPOL1</name>
                           <description>Dual-slope PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALCOMPAREPOL0</name>
                           <description>Dual Compare PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALCOMPAREPOL1</name>
                           <description>Dual Compare PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL2</name>
                     <description>Channel 2 Polarity</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>POL2Select</name>
                        <enumeratedValue>
                           <name>SINGLESLOPEPOL0</name>
                           <description>Single-slope PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLESLOPEPOL1</name>
                           <description>Single-slope PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALSLOPEPOL0</name>
                           <description>Dual-slope PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALSLOPEPOL1</name>
                           <description>Dual-slope PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALCOMPAREPOL0</name>
                           <description>Dual Compare PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALCOMPAREPOL1</name>
                           <description>Dual Compare PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL3</name>
                     <description>Channel 3 Polarity</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>POL3Select</name>
                        <enumeratedValue>
                           <name>SINGLESLOPEPOL0</name>
                           <description>Single-slope PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLESLOPEPOL1</name>
                           <description>Single-slope PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALSLOPEPOL0</name>
                           <description>Dual-slope PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALSLOPEPOL1</name>
                           <description>Dual-slope PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALCOMPAREPOL0</name>
                           <description>Dual Compare PWM waveform generation Channel Polarity 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUALCOMPAREPOL1</name>
                           <description>Dual Compare PWM waveform generation Channel Polarity 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWAP0</name>
                     <description>Swap DTI Output Pair 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWAP1</name>
                     <description>Swap DTI Output Pair 1</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWAP2</name>
                     <description>Swap DTI Output Pair 2</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWAP3</name>
                     <description>Swap DTI Output Pair 3</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PER</name>
               <description>Period</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PER</name>
                     <description>Period Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PER_DITH4_MODE</name>
               <description>Period</description>
               <alternateRegister>PER</alternateRegister>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Period Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PER_DITH5_MODE</name>
               <description>Period</description>
               <alternateRegister>PER</alternateRegister>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Period Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PER_DITH6_MODE</name>
               <description>Period</description>
               <alternateRegister>PER</alternateRegister>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Period Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC[%s]</name>
               <description>Compare and Capture</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CC</name>
                     <description>Channel Compare/Capture Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC_DITH4_MODE[%s]</name>
               <description>Compare and Capture</description>
               <alternateRegister>CC[%s]</alternateRegister>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CC</name>
                     <description>Channel Compare/Capture Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC_DITH5_MODE[%s]</name>
               <description>Compare and Capture</description>
               <alternateRegister>CC[%s]</alternateRegister>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CC</name>
                     <description>Channel Compare/Capture Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC_DITH6_MODE[%s]</name>
               <description>Compare and Capture</description>
               <alternateRegister>CC[%s]</alternateRegister>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHER</name>
                     <description>Dithering Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CC</name>
                     <description>Channel Compare/Capture Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
